var APP_DATA = {
  "scenes": [
    {
      "id": "0---",
      "name": "Площа Лесі Українки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 0.04669962051109877,
        "pitch": 0.155079371732338,
        "fov": 1.4404666184485553
      },
      "linkHotspots": [
        {
          "yaw": -0.13105635740318533,
          "pitch": 0.10983295024386308,
          "rotation": 0,
          "target": "1-----"
        },
        {
          "yaw": -3.1289275732315645,
          "pitch": 0.1714599796540366,
          "rotation": 0,
          "target": "5-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.01622731637541186,
          "pitch": 0.14384849222448892,
          "title": "Пам'ятник - Леся Українка",
          "text": "<p style=\"margin-top: 0.5em; margin-bottom: 0.5em; background-color: rgb(255, 255, 255);\" _msttexthash=\"68026738\" _msthash=\"135\"><font color=\"#202122\" face=\"sans-serif\"><span style=\"font-size: 14px;\" _msttexthash=\"5763905355\" _msthash=\"136\">Скульптуру виконано з єдиної брили червоного граніту Омел’янівського родовища Житомирської області. Пам’ятник встановлено у центрі земельного пагорбу, засадженого травою та листопадними деревами. Пагорб обмежений підпірною стінкою з полірованих блоків і плит червоного граніту. Площа навкруги пам’ятника вимощена бетонними плитами, влаштовано місця відпочинку, для благоустрою також використані поліровані плити червоного граніту Омел’янівського родовища. Поетесу зображено в мить відпочинку: вона присіла на скелю, на яку спирається лівою рукою. Правою рукою тримає книгу, яка лежить на колінах. Фігура трохи розвернута лівим боком на глядача. Голова повернута вліво і трохи донизу, що надає фігурі задумливості та мрійливості. Волосся зображені зачесаними наверх і зібрані на потилиці. Коміром і лівою полою жакета ніби грається легкий вітерець, що надає динаміки і поетичності. Образне та пластичне рішення пам’ятника вражає глибиною психологічної характеристики, цілісністю, виразністю силуету та портретною достовірністю.</span></font><br></p>"
        }
      ]
    },
    {
      "id": "1-----",
      "name": "Палац Культури ім. Лесі Українки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.044323612666078205,
        "pitch": 0.1147077884201817,
        "fov": 1.4404666184485553
      },
      "linkHotspots": [
        {
          "yaw": -0.4794199321080459,
          "pitch": 0.16450048853942079,
          "rotation": 0,
          "target": "4--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.02705812240188088,
          "pitch": 0.028429822601671262,
          "title": "Палац культури ім. Лесі Українки",
          "text": "Побудовано та відкрито 1972 року.&nbsp;"
        }
      ]
    },
    {
      "id": "2---",
      "name": "Стіни Звягельського замку",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [],
      "infoHotspots": []
    },
    {
      "id": "3--",
      "name": "Звягельський Дзвін",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -2.5876171231950558,
        "pitch": 0.09841721055483887,
        "fov": 1.4404666184485553
      },
      "linkHotspots": [
        {
          "yaw": -2.5264363601128537,
          "pitch": 0.2087156123837115,
          "rotation": 0,
          "target": "4--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "4--",
      "name": "Замкова площа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.2196340632535083,
          "pitch": 0.1812606893315536,
          "rotation": 0,
          "target": "3--"
        },
        {
          "yaw": 1.5349145374414572,
          "pitch": 0.1721381124856336,
          "rotation": 0,
          "target": "1-----"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.016502984243475183,
          "pitch": 0.2567624552814394,
          "title": "Скульптура \"Лукаш та Мавка\"",
          "text": "Text"
        },
        {
          "yaw": -1.0984553941506068,
          "pitch": 0.19353983044513257,
          "title": "Пам'ятний знак \"Преображенський Собор\",",
          "text": "Text"
        },
        {
          "yaw": -3.0603511229572167,
          "pitch": 0.1869659540815256,
          "title": "\"Звягельський замок\"",
          "text": "Text"
        }
      ]
    },
    {
      "id": "5-",
      "name": "Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 0.055939464752118084,
        "pitch": 0.010020443500151188,
        "fov": 1.4404666184485553
      },
      "linkHotspots": [],
      "infoHotspots": [
        {
          "yaw": 0.030517779575692572,
          "pitch": 0.005671229549305323,
          "title": "Кінотеатр / Молодіжний центр",
          "text": "22 вересня 1951 року відбулося офіційне відкриття кінотеатру ім. Щорса, але насправді його історія значно довша. Наш кінотеатр повною мірою розділив свою долю з долею корінних звягелян: репресії 30-х років, Другу світову війну, роки післявоєнної відбудови, хрущовську відлигу, брежнєвську епоху, розпад Радянського Союзу, заснування незалежної України та часи становлення нової держави."
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "qtvr",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
